# Pandas I
* Series 생성
* Series 인덱싱
* DataFrame 생성
* DataFrame 인덱싱: 기본, loc, iloc
* 인덱싱? 인덱스를 이용해 검색하는 것

# 1. Series 
value(ndarray) + index

## 1.1 Series 생성

In [201]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [137]:
type(s)

pandas.core.series.Series

In [143]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [144]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [145]:
# 인덱스 없이도 생성할 수 있다.
a = pd.Series(range(10,14))

In [146]:
a.index

RangeIndex(start=0, stop=4, step=1)

## 1.2 Series 인덱스, 슬라이싱

In [147]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [148]:
s[1]

3448737

In [149]:
s['서울']

9904312

In [154]:
s[['서울','부산','대구']]

서울    9904312
부산    3448737
대구    2466052
dtype: int64

In [156]:
s['서울':'인천'] #슬라이싱

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [163]:
s[1:3]

부산    3448737
인천    2890451
dtype: int64

## 1.3 Series 순회

In [164]:
for k, v in s.items():
    print(f"{k}={v}")

서울=9904312
부산=3448737
인천=2890451
대구=2466052

In [170]:
for region, pop in zip(s.index,s.values):
    print(region,"=",pop)

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

## 1.4 시리즈 연산

In [174]:
인구_2015 = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
인구_2010 = pd.Series({"서울": 9631482, "인천": 2632035, "대전": 1490158, "부산": 3393191})

In [175]:
인구_2015

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [176]:
인구_2010

서울    9631482
인천    2632035
대전    1490158
부산    3393191
dtype: int64

In [177]:
#인덱스 기반으로 연산
인구_2015-인구_2010

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [181]:
(인구_2015-인구_2010).notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [184]:
# 결측치 제거
ds = 인구_2015-인구_2010
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [185]:
#인구 증가율 구하기
rs = (인구_2015-인구_2010)/인구_2010  * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [190]:
#딕셔너리 연산도 수행가능
print('서울' in 인구_2015)

for k, v in 인구_2015.items():
    print(f"{k}={v}")

True
서울=9904312
부산=3448737
인천=2890451
대구=2466052

# 2. DataFrame

* Sereis는 1차원, DataFrame은 2차원
* values + index + columns

## 2.1 DataFrame 생성

In [192]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [195]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [196]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [197]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

## 2.2 인덱싱

In [215]:
# 열 인덱스 (한개)
df['2015']

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [207]:
#열 여러개 인덱스
df[['2010','2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [214]:
# 행 슬라이스
df[0:1]

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283

In [116]:
# 행슬라이스
df['부산':'인천']

     지역     2015     2010     2005     2000  2010-2015 증가율
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982

## 2.3 고급 인덱싱
* [행,열] 형식으로 추출할 수 있게 하여 가시성을 높여 준다.
* loc : 레이블(=키)을 기반으로 한다.
* iloc : 인덱스 값을 기반으로 한다.

In [223]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

### loc

In [226]:
# 열선택
df.loc[:,'A']

a    10
b    14
c    18
Name: A, dtype: int64

In [230]:
# 행선택
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [231]:
#행,열선택
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int64

In [232]:
#부분 행,열 선택
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [233]:
# 한개의 행 선택
df.loc["b", :]

A    14
B    15
C    16
D    17
Name: b, dtype: int64

In [241]:
#조건부 행선택
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

### iloc

In [131]:
df.iloc[0, 1]

11

In [132]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int64

In [133]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [134]:
df.iloc[list(df.iloc[:,0]>10), [2,3]] # df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21